
from datetime import date

day = int(input("Введiть день Вашого народження: "))
month = int(input("Введiть мiсяць Вашого народження: "))

if not (1 <= day <= 31 and 1 <= month <= 12):
    print("Помилка. Неправильний день чи місяць.")
    exit()

user_date = date(2023, month, day)

if date(2023, 1, 21) <= user_date <= date(2023, 2, 18):
    print("Ви Водолій.")
    print("""У 2023 році вам усміхнеться удача! Ви можете відчувати себе більш енергійними, ніж будь-коли раніше, і це
впевнено перенесе вас у другий квартал року. Якщо ви докладете зусиль під час нового року, ви можете опинитися в дуже
стабільному фінансовому становищі. Дуже скоро ви можете отримати підвищення або просування по службі завдяки вашим
старанням.
Робочі зобов’язання можуть завадити вам проводити достатньо часу з родиною та друзями вдома. Важкий початок року в
любові не триватиме вічно. Ваш позитивний погляд і довіра у відносинах можуть допомогти зміцнити їх.
Збереження свого здоров'я має бути одним із ваших головних пріоритетів.""")

elif date(2023, 2, 19) <= user_date <= date(2023, 3, 20):
    print("Ви Риби.")
    print("""Ви отримаєте те, чого бажаєте у 2023 році! Ви можете знайти нові можливості, які допоможуть вам досягти
успіху в усіх сферах життя. Ви будете почуватися добре, і це може привести до швидшого та кращого прийняття рішень.
У році Кролика вам не варто переосмислювати будь-які важливі рішення, які ви зробили для своєї кар’єри. У другій
половині року ви можете знайти кращі вакансії.
Якщо ви і ваш партнер зустрічаєтеся деякий час, вам слід набратися сміливості, щоб зробити рішучий крок і одружитися.
Ви можете очікувати, що ваш дім і сімейне життя продовжуватимуть процвітати завдяки вашим зусиллям.
Четвертий квартал - сприятливий час для нових інвестицій у нерухомість, але лише після ретельного розгляду та вивчення.""")

elif date(2023, 3, 21) <= user_date <= date(2023, 4, 20):
    print("Ви Овен.")
    print("""Астрологи радять вам залишити минуле позаду, почати все заново і намагатися мислити нестандартно.
Декому передбачається підвищення заробітку. Нові бізнес-проекти мають хороші шанси на успіх у 2023 році, а інвестиції
також принесуть прибуток.
Ви можете помітити, що вас захоплюють романтичні думки і хочеться більше спілкуватися у перші кілька місяців року.
У перші два квартали року варто приділити підвищену увагу своєму здоров’ю, і не давати стресу владу над собою.""")

elif date(2023, 4, 21) <= user_date <= date(2023, 5, 21):
    print("Ви Телець.")
    print("""Ви можете сподіватися на новий початок і щасливий Новий рік! Цей період принесе вам ряд перешкод, але й
значні винагороди. У 2023 році не варто ні в чому поспішати, ні в що ризиковано вкладати кошти, ні витрачати гроші на
непотрібне.
Освоєння нової сфери знань або набору навичок може допомогти вам піднятися кар'єрними сходами. Дехто з вас може захотіти
відкрити власну справу.
Дотримуючись розпорядку фізичної активності та повноцінного харчування, ви можете наблизитися до своїх фітнес-цілей.
Можливо, на початку року вам доведеться вирішувати проблеми у ваших романтичних стосунках.""")

elif date(2023, 5, 22) <= user_date <= date(2023, 6, 21):
    print("Ви Близнята.")
    print("""Близнюки можуть розраховувати на плідний рік. Проблем з роботою більше не буде, і удача буде світити вам.
Деякі з вас можуть взяти на себе додаткові обов’язки.
Романтика і кохання можуть розквітнути цього року. Рівень взаєморозуміння серед близьких залишиться високим.
Незважаючи на хиткий початок року, здоров’я, ймовірно, значно покращиться до другого кварталу та пізніше. Ви повинні
залишатися енергійними та включити фізичні вправи у свій розпорядок дня, щоб насолоджуватися перевагами здорового тіла.
Останні три місяці року можуть ознаменуватися прибутками, несподіваними прибутками та фантастичними можливостями
зробити накопичення.""")

elif date(2023, 6, 22) <= user_date <= date(2023, 7, 22):
    print("Ви Рак.")
    print("""2023 рік буде для вас фантастичним. Можливе підвищення на посаді і/або збільшення зарплати. Ви можете
отримати стрімкий успіх і матеріальний достаток в останній чверті року. Послідовні, невеликі, але постійні зусилля
протягом тривалого часу - це те, що потрібно, щоб досягти чогось.
Плани щодо поліпшення вашого фінансового становища можуть почати здійснюватися. Однак варіант швидко або легко
збагатитися не варто розглядати.
Відносини з близькими людьми, швидше за все, зазнають незначних коливань. Щоб зберегти мир вдома в цьому році, вам
доведеться піти на деякі поступки.
Будьте особливо уважні до свого здоров’я.""")

elif date(2023, 7, 23) <= user_date <= date(2023, 8, 21):
    print("Ви Лев.")
    print("""У новому році для Левів буде багато можливостей. Зберігайте холоднокровність і зосередженість, якщо хочете
насолоджуватися можливостями, які вам випадуть. Просування в кар'єрі прийде через наполегливу працю. Встановіть якомога
більше особистих і професійних контактів.
Спільні підприємства та інші непрямі інвестиції, ймовірно, будуть успішними в першій половині року.
Після перших трьох місяців року у вас будуть мирні та дружні стосунки з вашими близькими. Ваші стосунки з половинкою
процвітатимуть, коли ви вирішите свої розбіжності як пара. Для когось можуть задзвонити "весільні дзвони".
Здоровий спосіб життя та догляд за собою мають бути вашими керівними принципами на наступний рік.""")

elif date(2023, 8, 22) <= user_date <= date(2023, 9, 23):
    print("Ви Діва.")
    print("""У 2023 році успіх буде з вами! В першій половині року можуть з’явитися нові можливості, вам відкриється
шлях до абсолютно нових починань.
Завдяки ретельному фінансовому плануванню цей рік має бути дуже плідним у фінансовому плані. Ваше професійне життя почне
покращуватися цього року, якщо ви приймете розумні рішення щодо кар’єри та цілей.
2023 рік може бути мирним і спокійним удома. Проводьте час з тими, хто вам небайдужий.
Дотримання здорового способу життя забезпечить вас величезною енергією.""")

elif date(2023, 9, 24) <= user_date <= date(2023, 10, 23):
    print("Ви Терези.")
    print("""2023-й принесе з собою сприятливу пору. Астрологи кажуть, що ви маєте хороші шанси досягти своїх цілей у
другому кварталі року. Крім матеріального достатку, з'являться можливості для професійного зростання.
Сімейне життя може переживати як злети, так і падіння. Романтично налаштовані Терези можуть мати проблеми у стосунках.
Ті, хто страждає на деякі хронічні захворювання, можуть потребувати додаткової уваги.
Загалом, цей рік пропонує великий потенціал для просування. Декого з вас може чекати несподіваний спадок.""")

elif date(2023, 10, 24) <= user_date <= date(2023, 11, 22):
    print("Ви Скорпіон.")
    print("""2023 рік принесе вам багато змін. Ваше фінансове становище, ймовірно, досягне нового максимуму. Ті, хто
володіє бізнесом, матимуть безпрецедентні можливості для зростання. Цього року ви можете досягти значних успіхів у
своїй кар’єрі. Особливо вдалим для вас буде останній квартал року.
Удома має панувати спокій і згода, але в останні дві-три чверті року все ще можуть бути певні проблеми.
Рік має великий потенціал, щоб досягти успіхів на романтичному фронті. Стріла Купідона може знайти тих, хто самотній і
шукає кохання.
Приділіть більше уваги своєму здоров'ю. Підтримуючи свій розум ясним за допомогою духовних практик, ви зможете побачити
власні обмеження.""")

elif date(2023, 11, 23) <= user_date <= date(2023, 12, 21):
    print("Ви Стрілець.")
    print("""2023 рік стане для вас роком, на який варто чекати з нетерпінням. Велика ймовірність, що цього року ви
досягнете нових висот. Завдяки постійному потоку проектів ви можете бути зайняті цілий рік.
Використовуйте свою інтуїцію, коли справа доходить до фінансових питань, щоб забезпечити успіх вашого бізнесу.
Це буде вдалий рік для ваших стосунків. У другій половині 2023 року Стрільці почуватимуться емоційно спокійніше, що
дозволить їм більше зосередитися на домашніх клопотах.
Ви та ваш партнер можете стати щасливішими та ближчими один до одного. Цей прийдешній рік має бути одним із
найздоровіших у вашому житті.""")

elif date(2023, 12, 22) <= user_date <= date(2023, 12, 31) or date(2023, 1, 1) <= user_date <= date(2023, 1, 20):
    print("Ви Козеріг.")
    print("""Зустрічайте 2023 рік з усмішкою! Існує потенціал для зростання доходів і, як наслідок, збільшення
багатства. Що б ви не робили зі своїми грошима, все вийде тільки на краще. Ви можете досягти успіху на фронті кар’єри
на початку року.
Щастя і мир будуть у вашому домі і стосунках. Це сприятливий рік для створення сім’ї, тому, якщо ви думали про те, щоб
одружитися, зараз саме час.
Більшу частину року ви повинні відчувати себе фантастично. Ваш безмежний оптимізм повинен допомогти вам подолати
будь-які труднощі.
Купівля та інвестиції в нерухомість в останньому кварталі року принесуть позитивні результати. Якщо випаде можливість
подорожувати, нею не завадить скористатися.""")
