
n = int(input("Введiть число: "))
i = 0
j = 0
summ = 0

# Вивести всі числа від 0 до N, які діляться на 3:

print(f"Bсі числа від 0 до {n}, які діляться на 3 без залишку:")
while i <= n:
    if i % 3 == 0:
        print(i)
    i += 1
# else:                                 Цi два рядка будуть потрiбнi при змiнi умови, так як будь яке число можна дiлити
#     print("Такi числа вiдсутнi.")     на 0 i в залишку буде 0. Або можна використати n = abs(n), хоча це буде помилка.

# Вивести суму чисел від 0 до N, які поділяються на 3 без залишку:

while j <= n:
    if j % 3 == 0:
        summ += j
    j += 1
print(f"Сума чисел від 0 до {n}, які поділяються на 3 без залишку: {summ}.")
