
a = float(input('Введiть "a" сторону трикутника: '))
b = float(input('Введiть "b" сторону трикутника: '))
c = float(input('Введiть "c" сторону трикутника: '))
np = (a+b+c) / 2  # np - напiвпериметр
s = ((np * (np - a) * (np - b) * (np - c)) ** (1 / 2))
print(f"Площа трикутника за формулою Герона: {round(s, 2)}")
# print(f"Площа трикутника за формулою Герона: {s}")

"""
Якщо a=3, b=4, c=5, то вiдповiдь буде 6.0. Але я округлив
вiдповiдь до 2 знакiв пiсля коми, щоб вигляд був читабельний.
Бо якщо взяти значення a=2, b=3, c=4, то вiдповiдь буде
2.9047375096555625. Але якщо потрiбна точна вiдповiдь,
то треба просто закоментувати строку 7 и розкоментувати
строку 8.
"""
